run/cylinderFlap_FSI3_manifoldMapping/fluid-level-1/system/fvSolution
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 root "";
 case "";
 instance "";
 local "";
 class dictionary;
 object fvSolution;
}

solvers
{
  Up
  {
    solver BiCGStab;
    preconditioner Cholesky;
    tolerance 1e-13;
    relTol 1e-05;
    minIter 5;
    maxIter 500;
  }
  "(p|pFinal)"
  {
    solver PCG;
    preconditioner DIC;
    tolerance 1e-11;
    relTol 0.001;
    minIter 1;
  }
  "(U|UFinal)"
  {
    solver PBiCG;
    preconditioner DILU;
    tolerance 1e-11;
    relTol 0.001;
    minIter 1;
  }
}

blockSolver
{
  pRefCell 0;
  pRefValue 0;
  nOuterCorrectors 500;
  convergenceTolerance 1e-11;
}

PIMPLE
{
  nOuterCorrectors 500;
  nCorrectors 1;
  nNonOrthogonalCorrectors 0;
}

