run/cylinderFlap_FSI3_manifoldMapping/fluid-level-1/system/decomposeParDict
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 object decomposeParDict;
}

numberOfSubdomains 3;

method scotch; 	// ************************************************************************* //
